app/Controllers/Home.php

    public function index()
    {
        $db = db_connect();
        $data['mahasiswa'] = $db->table('tb_mahasiswa')->get()->getResult();
---
SELECT *
FROM `tb_mahasiswa`

    public function save()
    {
        $db = db_connect();

        $nobp = $this->request->getPost('nobp');

        $cekNobp = $db->table('tb_mahasiswa')->where('nobp', $nobp)->get()->getNumRows();

        if($cekNobp > 0){
            echo "<script>
                    alert('Nobp Sudah Ada');
                    window.location='/';
                  </script>";
        }else{
            $data = [
                'nobp' => $this->request->getPost('nobp'),
                'nama' => $this->request->getPost('nama'),
                'alamat' => $this->request->getPost('alamat'),
            ];
        }

        $simpan = $db->table('tb_mahasiswa')->insert($data);
---
SELECT *
FROM `tb_mahasiswa`
WHERE `nobp` = '1800003'
INSERT INTO `tb_mahasiswa` (`nobp`, `nama`, `alamat`) VALUES ('1800003', 'GUSDI', 'Padang')